In [236]:
import pandas as pd
import numpy as np
import time
import math

from scipy.fft import ifft2

df = pd.read_csv(f"job_placement.csv")

In [237]:
salary = df['salary']

In [238]:
salary

0      60000
1      65000
2      58000
3          0
4      62000
       ...
695    67000
696    66000
697    65000
698    66000
699        0
Name: salary, Length: 700, dtype: int64

In [239]:
def normalization(data):
    data = [i for i in data if i != 0]
    data = sorted(data)
    for i in range(len(data)):
        data[i] = (data[i] - data[0]) / (data[-1] - data[0])
    return pd.DataFrame(data)

In [240]:
start = time.time()

salary = normalization(salary)

end = time.time()

print(end - start, 'seconds')

0.0002818107604980469 seconds

In [241]:
salary

            0
0    0.000000
1    0.852941
2    0.867647
3    0.867647
4    0.867647
..        ...
565  1.000000
566  1.000000
567  1.000000
568  1.000000
569  1.000000

[570 rows x 1 columns]

In [242]:
start = time.time()
salary = np.power(salary, math.e)
end = time.time()
print(end - start, 'seconds')

0.00014901161193847656 seconds

In [243]:
salary

            0
0    0.000000
1    0.648961
2    0.679828
3    0.679828
4    0.679828
..        ...
565  1.000000
566  1.000000
567  1.000000
568  1.000000
569  1.000000

[570 rows x 1 columns]